In [2]:
import pandas as pd
import numpy as np

In [3]:
data=pd.read_excel("Healthcare.xlsx")

In [4]:
data.head()

     date  total_attacks
0  1-2006             12
1  1-2008             70
2  1-2009             71
3  1-2010             38
4  1-2011            168

In [5]:
data.tail()

       date  total_attacks
158  9-2016             73
159  9-2017            140
160  9-2018             18
161  9-2019             84
162  9-2020             16

In [6]:
data.describe()

       total_attacks
count     163.000000
mean      149.079755
std       126.170323
min         1.000000
25%        38.500000
50%       120.000000
75%       241.000000
max       505.000000

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163 entries, 0 to 162
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           163 non-null    object
 1   total_attacks  163 non-null    int64
dtypes: int64(1), object(1)
memory usage: 2.7+ KB

In [8]:
data['date']=data['date'].apply(pd.to_datetime)

In [9]:
data.head()

        date  total_attacks
0 2006-01-01             12
1 2008-01-01             70
2 2009-01-01             71
3 2010-01-01             38
4 2011-01-01            168

In [10]:
data.sort_values(by='date',inplace=True)

In [1]:
data=data.reset_index(drop=True)

NameError: name 'data' is not defined

In [2]:
data.tail(10)

NameError: name 'data' is not defined